#include <stdio.h>
int main()
{
	//多函数程序的执行过程 
	//变量仅存在于定义他们的语句块中
	//变量在一个块内声明时创建，在这个块结束时销毁 -- 自动变量
	//变量存在的时间称为变量的生存期 
	int num1 = 9;
	int count1=0;
	int count3=0;
	{//代码块 -- 域 
		int num2=90;
		printf("%d\n",num1+num2); //内部代码块可以访问外部，外部代码不能访问内部的代码块 
	}
	printf("%d\n",num1);
	//****************************************************************************************
	do{
		int count2=0; 
		count2++;
		printf("%d\t%d\n",count1,count2);
	} while(++count1<5);
	//****************************************************************************************
	do{
		int count3=0; 
		count3++;
		printf("%d\n",count3);
	} while(++count3<5);//外部的count3 
	printf("%d\n",count3);
} 
