#include <stdio.h>
#include <ctype.h>
#include <math.h>
#include <stdlib.h>
#include <time.h> 
int main()
{
	//常用内置函数
	//******************************************************************************************** 
	printf("%d\n",isupper('a'));//isupper：判断是否为大写字母，如果是返回值为非0，不是为0
	printf("%d\n",islower('a'));//islower:判断是否是小写字母，如果是返回值为非0，不是为0
	printf("%d\n",isalpha(97));//isalpha:字符是否是字母,如果是返回值为非0，不是为0
	printf("%d\n",isdigit(50));//isdigit:字符是否是数字,如果是返回值为非0，不是为0
	//如果只填数字表示的是ASCII码
	printf("小写转大写：%c\n",toupper('a'));//toupper将小写转换为大写 
	//以上函数包含在<ctype.h>头文件中 
	//********************************************************************************************
	//********************************************************************************************
	printf("%.2lf\n",ceil(98.1));  //ceil函数小数进一位(进一法) 
	printf("%.2lf\n",ceil(-98.1)); //如果是负数规律相反 
	printf("%.2lf\n",floor(98.9)); //floor函数舍去小数(去尾法)
	printf("%.2lf\n",floor(-98.9));//如果是负数规律相反
	printf("%.2lf\n",sqrt(9));	   //求平方根 
	printf("%.2lf\n",pow(5,2));	   //求第一个数字的第二个数字次方
	printf("%d\n",abs(-98));       //求绝对值,返回的是一个整形
	//以上函数在<math.h>头文件里面 
	//********************************************************************************************
	//********************************************************************************************
	//1.设置随机种子,一般和时间连用 ，调用<time.h>头文件 
	srand(time(NULL)); //NULL表示空 
	//2.取随机数
	int num =rand ();
	printf("%d",num); 
	exit(0);//正常退出应用程序，0表示正常退出应用程序，非0表示非正常退出
	return 0;
	//以上函数在<stdlib.h>头文件中 
 } 
 
