#include <Stdio.h>
#include <math.h>
/*
假设银行整存整取存款不同期限的月息利率分别为: 
0.63% 期限= 1 年 0.66% 期限 =2 年 0.69% 期限= 3 年 0.75% 期限 =5 年 0.84% 期限 =8 年 利息=本金×月息利率 X12X 存款年限。 
现在某人手中有 2000 元，
请通过计算选择一种存钱方案，使得钱存入银行 20 年后得到的 利息最多(假定银行对超过存款期限的那部分时间不付利息)。 */
/*解题思路：穷举所有利息 */
int main()
{
	int i8, i5, i3, i2, i1, n8, n5, n3, n2, n1;
	double max = 0, term;
	for(i8 = 0; i8 < 3; i8++)
	{
		for(i5 = 0; i5 <= (20 - i8 * 8) / 5; i5++)
		{
			for(i3 = 0; i3 <= (20 - i8 * 8 - i5 * 5) / 3; i3++)
			{
				for(i2 = 0; i2 <= (20 - i8 * 8 - i5 * 5 - i3 * 3) / 2; i2++)
				{
					i1 = 20 - i8 * 8 - i5 * 5 - i3 * 3 -  i2 * 2;
					term = 2000.0 * pow((double)(1 + 8 * 0.0084 * 12),(double)i8)
					*pow((double)(1 + 5 * 0.0075 * 12), (double)i5)
					*pow((double)(1 + 3 * 0.0069 * 12), (double)i3)
					*pow((double)(1 + 2 * 0.0066 * 12), (double)i2)
					*pow((double)(1 + 1 * 0.0063 * 12), (double)i1);
					if(term > max)
					{
						max = term;
						n1 = i1; n2 = i2; n3 = i3; n5 = i5; n8 = i8;
					}
				}
			}
		}
	}
	printf("8年：%d,5年：%d,3年：%d,2年：%d,1年：%d\n存款结果为：%lf",n8,n5,n3,n2,n1,max);
}
